## STEP-1

## IMPORT LIBRARIES AND CUSTOMER DATA FRAME

In [1]:
import pandas as pd
import numpy as np
import os

In [2]:
path=r'C:\Users\Jatin\Documents\05-05-InstaCartBasketAnalysis'

In [3]:
# import customer data frame
df_customers=pd.read_csv(os.path.join(path,'2 Data','Original Data','customers.csv'),index_col=False)

In [4]:
df_customers.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [5]:
df_customers.shape

(206209, 10)

In [6]:
df_customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 206209 entries, 0 to 206208
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   user_id       206209 non-null  int64
 1   First Name    194950 non-null  object
 2   Surnam        206209 non-null  object
 3   Gender        206209 non-null  object
 4   STATE         206209 non-null  object
 5   Age           206209 non-null  int64
 6   date_joined   206209 non-null  object
 7   n_dependants  206209 non-null  int64
 8   fam_status    206209 non-null  object
 9   income        206209 non-null  int64
dtypes: int64(4), object(6)
memory usage: 15.7+ MB

## STEP-4

In [7]:
# renaming surname as lastname
df_customers.rename(columns={'Surnam':'Last_name'},inplace=True)

In [8]:
# renaming n_dependants as number_of_dependants
df_customers.rename(columns={'n_dependants':'number_of_dependants'},inplace=True)

In [9]:
# renaming fam_status as Marital status
df_customers.rename(columns={'fam_status':'Marital status'},inplace=True)

In [10]:
df_customers.head()

,user_id,First Name,Last_name,Gender,STATE,Age,date_joined,number_of_dependants,Marital status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## STEP-5

In [11]:
# changing the type of user_id as string. since this column, I will not use to perform calculation
df_customers['user_id']=df_customers['user_id'].astype('str')

In [12]:
df_customers.dtypes

user_id                 object
First Name              object
Last_name               object
Gender                  object
STATE                   object
Age                      int64
date_joined             object
number_of_dependants     int64
Marital status          object
income                   int64
dtype: object

In [13]:
# check for mixed type data
for col in df_customers .columns.tolist():
    weird=(df_customers[[col]].applymap(type)!=df_customers[[col]].iloc[0].apply(type)).any(axis=1)
    if len(df_customers[weird])>0:
        print(col)

First Name

In [14]:
#changing 'First Name' column data type into string
df_customers['First Name']=df_customers['First Name'].astype('str')

In [15]:
# check for missing values
df_customers.isnull().sum()

user_id                 0
First Name              0
Last_name               0
Gender                  0
STATE                   0
Age                     0
date_joined             0
number_of_dependants    0
Marital status          0
income                  0
dtype: int64

### 11259 missing values were found in 'First Name' column. But, after changing 'First Name' column into string, it does not show blank or null values.

In [16]:
#check for duplicate values
df_dups=df_customers[df_customers.duplicated()]

In [17]:
df_dups

Empty DataFrame
Columns: [user_id, First Name, Last_name, Gender, STATE, Age, date_joined, number_of_dependants, Marital status, income]
Index: []

In [18]:
df_dups.shape

(0, 10)

### There are no duplicates found.

## STEP-6

In [20]:
# import 'df_orders_products_merged_updated_2.pkl' 
ords_prods_merge=pd.read_pickle(os.path.join(path,'2 Data','Prepared Data','df_orders_products_merged_updated_2.pkl'))

In [21]:
ords_prods_merge.shape

(32404859, 24)

In [22]:
ords_prods_merge.dtypes

order_id                    int64
user_id                     int64
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_last_order     float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
_merge                   category
price_range_loc            object
busiest_day                object
busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
avg_price                 float64
spending_flag              object
median_frequency          float64
customer                   object
dtype: object

In [23]:
#changing 'user_id' datatype into string
ords_prods_merge['user_id']=ords_prods_merge['user_id'].astype('str')

In [24]:
ords_prods_merge.dtypes

order_id                    int64
user_id                    object
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_last_order     float64
product_id                  int64
add_to_cart_order           int64
reordered                   int64
product_name               object
aisle_id                    int64
department_id               int64
prices                    float64
_merge                   category
price_range_loc            object
busiest_day                object
busiest_days               object
busiest_period_of_day      object
max_order                   int64
loyalty_flag               object
avg_price                 float64
spending_flag              object
median_frequency          float64
customer                   object
dtype: object

In [25]:
#merge the data frames on the 'user_id' column
df_merged=ords_prods_merge.merge(df_customers,on='user_id')

## STEP-7

In [26]:
df_merged.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_last_order,product_id,add_to_cart_order,reordered,product_name,...,customer,First Name,Last_name,Gender,STATE,Age,date_joined,number_of_dependants,Marital status,income
0,2539329,1,1,2,8,NaN,196,1,0,Soda,...,Non frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
1,2398795,1,2,3,7,15.0,196,1,1,Soda,...,Non frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
2,473747,1,3,3,12,21.0,196,1,1,Soda,...,Non frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
3,2254736,1,4,4,7,29.0,196,1,1,Soda,...,Non frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423
4,431534,1,5,4,15,28.0,196,1,1,Soda,...,Non frequent customer,Linda,Nguyen,Female,Alabama,31,2/17/2019,3,married,40423

In [27]:
df_merged.rename(columns={'First Name':'first_name','Last_name':'last_name','Gender':'gender','STATE':'state','Age':'age','number_of_dependants':'total_dependants','Marital status':'marital_status'},inplace=True)

In [30]:
pd.options.display.max_columns=None

In [29]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 33 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               int64
 1   user_id                object
 2   order_number           int64
 3   orders_day_of_week     int64
 4   order_hour_of_day      int64
 5   days_since_last_order  float64
 6   product_id             int64
 7   add_to_cart_order      int64
 8   reordered              int64
 9   product_name           object
 10  aisle_id               int64
 11  department_id          int64
 12  prices                 float64
 13  _merge                 category
 14  price_range_loc        object
 15  busiest_day            object
 16  busiest_days           object
 17  busiest_period_of_day  object
 18  max_order              int64
 19  loyalty_flag           object
 20  avg_price              float64
 21  spending_flag          object
 22  median_frequency       float64
 23  customer               object
 24  first_name             object
 25  last_name              object
 26  gender                 object
 27  state                  object
 28  age                    int64
 29  date_joined            object
 30  total_dependants       int64
 31  marital_status         object
 32  income                 int64
dtypes: category(1), float64(4), int64(13), object(15)
memory usage: 8.0+ GB

In [44]:
# changing datatypes to reduce memory size
df_merged['order_id']=df_merged['order_id'].astype('str')
df_merged['order_number']=df_merged['order_number'].astype('int8')
df_merged['orders_day_of_week']=df_merged['orders_day_of_week'].astype('int8')
df_merged['order_hour_of_day']=df_merged['order_hour_of_day'].astype('int8')
df_merged['days_since_last_order']=df_merged['days_since_last_order'].astype('float16')
df_merged['product_id']=df_merged['product_id'].astype('int32')
df_merged['reordered']=df_merged['reordered'].astype('int8')
df_merged['product_id']=df_merged['product_id'].astype('int32')
df_merged['department_id']=df_merged['department_id'].astype('int8')
df_merged['prices']=df_merged['prices'].astype('int8')
df_merged['price_range_loc']=df_merged['price_range_loc'].astype('str')
df_merged['max_order']=df_merged['max_order'].astype('int8')
df_merged['avg_price']=df_merged['avg_price'].astype('float16')
df_merged['median_frequency']=df_merged['median_frequency'].astype('float16')
df_merged['age']=df_merged['age'].astype('int8')
df_merged['total_depandants']=df_merged['total_depandants'].astype('int8')
df_merged['income']=df_merged['income'].astype('int32')

In [46]:
df_merged=df_merged.drop(columns=['first_name','last_name'])

In [47]:
df_merged.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32404859 entries, 0 to 32404858
Data columns (total 29 columns):
 #   Column                 Dtype
---  ------                 -----
 0   order_id               object
 1   user_id                object
 2   order_number           int8
 3   orders_day_of_week     int8
 4   order_hour_of_day      int8
 5   days_since_last_order  float16
 6   product_id             int32
 7   reordered              int8
 8   product_name           object
 9   department_id          int8
 10  prices                 int8
 11  price_range_loc        object
 12  busiest_day            object
 13  busiest_days           object
 14  busiest_period_of_day  object
 15  max_order              int8
 16  loyalty_flag           object
 17  avg_price              float16
 18  spending_flag          object
 19  median_frequency       float16
 20  customer               object
 21  gender                 object
 22  state                  object
 23  age                    int8
 24  date_joined            object
 25  total_dependants       int64
 26  marital_status         object
 27  income                 int32
 28  total_depandants       int8
dtypes: float16(3), int32(2), int64(1), int8(9), object(14)
memory usage: 4.6+ GB

## STEP-8

In [48]:
df_merged.to_pickle(os.path.join(path,'2 Data','Prepared Data','customers_merged.pkl'))